{
  "schema_version": "1.5.0",
  "id": "BIT-2023-32689",
  "details": "Parse Server is an open source backend that can be deployed to any infrastructure that can run Node.js. Versions prior to 5.4.4 and 6.1.1 are vulnerable to a phishing attack vulnerability that involves a user uploading malicious files. A malicious user could upload an HTML file to Parse Server via its public API. That HTML file would then be accessible at the internet domain at which Parse Server is hosted. The URL of the the uploaded HTML could be shared for phishing attacks. The HTML page may seem legitimate because it is served under the internet domain where Parse Server is hosted, which may be the same as a company's official website domain.An additional security issue arises when the Parse JavaScript SDK is used. The SDK stores sessions in the internet browser's local storage, which usually restricts data access depending on the internet domain. A malicious HTML file could contain a script that retrieves the user's session token from local storage and then share it with the attacker.The fix included in versions 5.4.4 and 6.1.1 adds a new Parse Server option `fileUpload.fileExtensions` to restrict file upload on Parse Server by file extension. It is recommended to restrict file upload for HTML file extensions, which this fix disables by default. If an app requires upload of files with HTML file extensions, the option can be set to `['.*']` or another custom value to override the default.",
  "aliases": [
    "CVE-2023-32689"
  ],
  "affected": [
    {
      "package": {
        "ecosystem": "bitnami",
        "name": "parse",
        "purl": "pkg:bitnami/parse"
      },
      "severity": [
        {
          "type": "CVSS_V3",
          "score": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N"
        }
      ],
      "ranges": [
        {
          "type": "SEMVER",
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "5.4.4"
            }
          ]
        },
        {
          "type": "SEMVER",
          "events": [
            {
              "introduced": "6.0.0"
            },
            {
              "fixed": "6.1.1"
            }
          ]
        }
      ]
    }
  ],
  "database_specific": {
    "severity": "Medium",
    "cpes": [
      "cpe:2.3:a:parseplatform:parse-server:*:*:*:*:*:node.js:*:*"
    ]
  },
  "references": [
    {
      "type": "WEB",
      "url": "https://github.com/parse-community/parse-server/pull/8537"
    },
    {
      "type": "WEB",
      "url": "https://github.com/parse-community/parse-server/pull/8538"
    },
    {
      "type": "WEB",
      "url": "https://github.com/parse-community/parse-server/security/advisories/GHSA-9prm-jqwx-45x9"
    }
  ],
  "published": "2023-09-14T13:42:21.926Z",
  "modified": "2023-09-14T13:50:47.856Z"
}