{
  "schema_version": "1.5.0",
  "id": "BIT-2020-6165",
  "details": "SilverStripe 4.5.0 allows attackers to read certain records that should not have been placed into a result set. This affects silverstripe/recipe-cms. The automatic permission-checking mechanism in the silverstripe/graphql module does not provide complete protection against lists that are limited (e.g., through pagination), resulting in records that should have failed a permission check being added to the final result set. GraphQL endpoints are configured by default (e.g., for assets), but the admin/graphql endpoint is access protected by default. This limits the vulnerability to all authenticated users, including those with limited permissions (e.g., where viewing records exposed through admin/graphql requires administrator permissions). However, if custom GraphQL endpoints have been configured for a specific implementation (usually under /graphql), this vulnerability could also be exploited through unauthenticated requests. This vulnerability only applies to reading records; it does not allow unauthorised changing of records.",
  "aliases": [
    "CVE-2020-6165"
  ],
  "affected": [
    {
      "package": {
        "ecosystem": "bitnami",
        "name": "silverstripe",
        "purl": "pkg:bitnami/silverstripe"
      },
      "severity": [
        {
          "type": "CVSS_V3",
          "score": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N"
        }
      ],
      "ranges": [
        {
          "type": "SEMVER",
          "events": [
            {
              "introduced": "3.2.0"
            },
            {
              "fixed": "3.2.4"
            }
          ]
        },
        {
          "type": "SEMVER",
          "events": [
            {
              "introduced": "3.2.5"
            },
            {
              "fixed": "3.3.0"
            }
          ]
        },
        {
          "type": "SEMVER",
          "events": [
            {
              "introduced": "4.5.0"
            },
            {
              "fixed": "4.5.3"
            }
          ]
        }
      ]
    }
  ],
  "database_specific": {
    "severity": "Medium",
    "cpes": [
      "cpe:2.3:a:silverstripe:silverstripe:*:*:*:*:*:*:*:*"
    ]
  },
  "references": [
    {
      "type": "WEB",
      "url": "https://www.silverstripe.org/download/security-releases/CVE-2020-6165"
    }
  ],
  "published": "2023-09-04T15:54:32.904Z",
  "modified": "2023-09-04T16:11:27.534Z"
}